{
  "intro": {
    "mainTitle": "eyeDesigner",
    "subtitle": "Jeu watchOs inspiré de Reigns",
    "authors": "Heitor Costa",
    "projectTitle": "eyeDesigner",
    "overview": "Project overview: A brief summary of what your project covers, and what kind of impact it had on the company.",
    "roles": [
      "Élaboration du concept",
      "Création des maquettes fonctionnelles",
      "Organisation du user flow",
      "Recherche d’inspiration",
      "Création des éléments visuels",
      "Présentation du concept"
    ],
    "tools": ["Figma", "Procreate", "Adobe Illustrator", "Adobe After effect"],
    "duration": "novembre 2021",
    "imageUrl": "/assets/images/projects/eyeDesigner/eyeD_00_Couverture.png"
  },
  "content": {
    "mandate": {
      "title": "Mandat",
      "content": "EyeDesigner est un projet personnel réalisé en un mois avec mon collègue Heitor Costa pour la soirée portfolio organisé par Ubisoft Québec. Nous nous étions lancé le défi de faire un jeu dans un format avec lequel nous n’étions pas familiers et qui aurait comme thème le métier de designer. Nous avons donc choisi de créer ce jeu pour le petit écran d’Apple Watch ce qui a amené des contraintes et des défis intéressants. Nous avions aussi un délai serré à respecter, en plus des cours de la maîtrise, qui a demandé une bonne organisation pour être en mesure de présenter une première version du jeu à l’expert en UX lors de la soirée portfolio du 1er décembre.",
      "section": {
        "titre": "Concept",
        "content": "Eye Designer, un clin d’œil au logo Eye Bee M de Paul Rand, est un jeu « choose your own adventure » satirique pour watchOs inspiré de Reigns (lien vers la page du jeu) et de Destin où le joueur est plongé dans le quotidien mouvementé d’un designer et où il devra prendre des décisions qui influenceront le cours de son histoire. Il devra toutefois faire attention au choix qu’il fera afin de garder le plus longtemps possible un équilibre entre son bonheur, son stress, sa réputation et son argent."
      },
      "content2": "Dans cette première version que nous avons créée, le joueur aura d’abord la possibilité de choisir l’un des quatre métiers suivants : illustrateur, designer graphique, designer UI/UX et designer industriel. Chacun d’eux a leurs particularités, ce qui influencera leurs jauges de départ et les évènements qu’ils rencontreront. Ensuite, il arrivera plusieurs péripéties issues de certains clichés bien connus du domaine qui amènera le joueur à prendre des décisions qui affecteront le niveau de ses quatre jauges (bonheur, stress, réputation et argent). Il pourra, par exemple, avoir à gérer un client qui aimerait avoir un logo plus grand et plus coloré ou encore qui refuse de payer, des problèmes techniques avec son ordinateur et bien plus. Le but est donc de continuer à jouer le plus longtemps possible sans vider complètement l’une des jauges, ce qui met fin à la partie."
    },
    "priorityList": {
      "title": "Liste de priorités",
      "content": "Une fois que le concept a été trouvé et précisé, nous avons énuméré les différents écrans de jeu et les informations qui se retrouveraient sur chacune d’elle en ordre de priorité. Cette étape nous a permis de clarifier certains aspects et a facilité la réalisation de la prochaine étape. L’organisation des différents menus a demandé beaucoup de réflexion et d’esquisses pour être en mesure de présenter toutes les informations nécessaires au bon moment sans toutefois surcharger le petit écran de l’Apple Watch."
    },
    "userFlow": {
      "title": "User flow",
      "content": "Le user flow a permis de concrétiser la version préliminaire des maquettes tout en ayant une meilleure idée du parcours qui serait suivi par le joueur. En ouvrant le jeu, le joueur devait pouvoir avoir accès facilement à sa partie en cours et, dans le cas d’une première partie, il devait pouvoir passer par les étapes de choix de personnage et de tutoriel pour être en mesure de bien comprendre le fonctionnement du jeu."
    },
    "inspiration": {
      "title": "Inspiration",
      "content": "Après avoir précisé davantage les interfaces grâce au user flow, nous avons commencé à chercher des idées de style qui serait cohérent avec le thème du jeu. Nous nous sommes donc inspirés majoritairement du style Bahaus avec des formes très géométriques, des grilles circulaires et des couleurs primaires. Nous avons également consulté d’autres jeux sur watchOs pour avoir une meilleure idée de la mise en page et des proportions utilisées pour les éléments visuels dans ce type de jeu."
    },
    "styleGuide": {
      "title": "Guide de style",
      "content": "Ensuite, j’ai entamé la création des différents pictogrammes pendant qu’Heitor se concentrait sur la phase de prototypage. Au fur et à mesure de la conception, nous avons été en mesure d’établir un guide de style plus précis avec une grille circulaire qui a permis de créer la majorité des éléments graphiques."
    },
    "sketches": {
      "title": "Maquettes haute-fidélité",
      "content": "Voici à quoi ressemble cette première version des interfaces avec l’intégration des visuels que nous avons créés et en réutilisant le user flow réalisé en début de projet."
    }
  },
  "conclusion": {
    "title": "Conclusion",
    "content": "Math en jeu a été un projet stimulant et enrichissant qui m’a appris beaucoup sur plusieurs aspects de la création de jeu allant de l’animation, à la création d’éléments 3D, à la collaboration avec les programmeurs, jusqu’à l’intégration."
  }
}
